
## Plan Result (sandbox/test-statement)

[CI link](https://github.com/tqer39/private-lab/actions/runs/2937084832)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.create-users.aws_iam_user.this[&#34;fuga&#34;]
  * module.create-users.aws_iam_user.this[&#34;hoge&#34;]
  * module.create-users.aws_iam_user.this[&#34;moga&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.create-users.aws_iam_user.this["fuga"] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "fuga"
      + path          = "/"
      + tags_all      = {
          + "pl:environment" = "sandbox"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-sandbox@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/sandbox/test-statement"
        }
      + unique_id     = (known after apply)
    }

  # module.create-users.aws_iam_user.this["hoge"] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "hoge"
      + path          = "/"
      + tags_all      = {
          + "pl:environment" = "sandbox"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-sandbox@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/sandbox/test-statement"
        }
      + unique_id     = (known after apply)
    }

  # module.create-users.aws_iam_user.this["moga"] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "moga"
      + path          = "/"
      + tags_all      = {
          + "pl:environment" = "sandbox"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-sandbox@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/sandbox/test-statement"
        }
      + unique_id     = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":143,"Program":"tfcmt","SHA1":"c9de3ae3e711b7cd4b61034bd5239459c5508ee2","Target":"sandbox/test-statement","Vars":{},"WorkflowName":"Terraform - AWS - Sandbox"} -->